Revit 2024 API
LabelUtils.GetLabelForGroup Method
 Gets the user-visible name for a built-in parameter group. To get the name of parameter group "Other", pass an empty, default-constructed ForgeTypeId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static string GetLabelForGroup(
	ForgeTypeId groupTypeId
)
Visual Basic
Public Shared Function GetLabelForGroup ( _
	groupTypeId As ForgeTypeId _
) As String
Visual C++
public:
static String^ GetLabelForGroup(
	ForgeTypeId^ groupTypeId
)
Parameters
groupTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 The identifier of the parameter group to get the user-visible name, or an empty ForgeTypeId for group "Other".
Remarks
 The name is obtained in the current Revit language.
See Also
LabelUtils Class
Autodesk.Revit.DB Namespace